{
    "educations": [
        {
            "id": "edu-1",
            "school": "Indonesia Open University",
            "degree": "Bachelor's Degree in Information Systems",
            "duration": "Sep 2022 - Present",
            "content": ["GPA: 3.09"]
        }
    ],
    "experiences": [
        {
            "id": "exp-1",
            "company": "Informatika Media Pratama",
            "position": "Software Engineer (Frontend)",
            "duration": "Oct 2021 - Present",
            "description": [
                "Engineered and maintained robust, scalable, and responsive user interfaces for web applications using modern technologies such as React.js, Redux, and TypeScript.",
                "Collaborated effectively with UI/UX designers and backend developers to transform wireframes and mockups into pixel-perfect, interactive user experiences.",
                "Optimized application performance by implementing efficient code, minimizing rendering times, and reducing load times, resulting in a smoother user experience.",
                "Developed and documented reusable UI components and libraries, promoting code consistency and accelerating development cycles across multiple projects.",
                "Integrated RESTful APIs to fetch and display dynamic data, ensuring seamless communication between the frontend and backend systems.",
                "Utilized Git for version control, managing codebases, and collaborating with a team in an agile development environment. Wrote clean, well-structured, and testable code to ensure long-term maintainability and easier debugging.",
                "Stayed current with emerging frontend technologies and best practices to introduce new tools and techniques that improved workflow and product quality."
            ]
        },
        {
            "id": "exp-2",
            "company": "Informatika Media Pratama",
            "position": "Lead Engineer",
            "duration": "Nov 2022 - Nov 2023",
            "description": [
                "Spearheaded development of scalable web and mobile applications using React, React Native, and TypeScript, ensuring high-quality, responsive user interfaces.",
                "Led and mentored a team of engineers, guiding them in TypeScript best practices and API integration, enhancing team productivity and code quality.",
                "Optimized application performance by refactoring data-fetching hooks and navigation flows, reducing rendering times and improving user experience.",
                "Collaborated with UI/UX designers and backend teams to deliver pixel-perfect, interactive interfaces with features like infinite scroll and real-time data validation.",
                "Implemented stricter coding standards.",
                "Integrated RESTful APIs and GraphQL endpoints for seamless data communication, ensuring reliable frontend-backend interactions.",
                "Developed reusable UI components and libraries, promoting code consistency and accelerating feature development across projects."
            ]
        },
        {
            "id": "exp-3",
            "company": "Rumah Coding Indonesia",
            "position": "Freelance Trainer",
            "duration": "Feb 2021 - Jun 2022",
            "description": [
                "Instructed and mentored young learners in foundational web development skills, covering HTML, CSS, and JavaScript, fostering their interest and abilities in coding.",
                "Developed and delivered a comprehensive curriculum for React.js, enabling students to learn and apply modern front-end development frameworks.",
                "Taught and guided students through the fundamentals of back-end development using the Laravel framework, broadening their understanding of full-stack development."
            ]
        }
    ],
    "skills": [
        {
            "title": "Programming",
            "tools": ["TypeScript", "JavaScript", "Python", "Php", "SQL", "React Native"]
        },
        {
            "title": "Web",
            "tools": ["React", "Next", "Django", "Redux", "Laravel"]
        },
        {
            "title": "Databases",
            "tools": ["MongoDB", "Redis", "MySQL", "Firebase"]
        }
    ]
}
