[
    {
        "id": "featured-project-pintar",
        "title": "PINTAR",
        "year": "2022",
        "location": "Jakarta",
        "demo": "https://pintar.kemenag.go.id/",
        "tags": ["React", "TypeScript"],
        "description": "PINTAR (Pusat Informasi Pelatihan dan Pembelajaran) is a web application developed for the Kementerian Agama (KEMENAG). It functions as a digital learning platform, offering online training and knowledge resources to KEMENAG employees and the public. The application is built with a powerful technology combination, using React.js for a dynamic and responsive user interface and Laravel for its robust back-end and secure data management. PINTAR aims to facilitate accessible, self-paced learning and competency development for a wide range of users.",
        "image": "/assets/featured-projects/pintar.webp",
        "jpg": "/assets/featured-projects/pintar.jpeg"
    },
    {
        "id": "featured-project-pusaka",
        "title": "Pusaka Super Apps",
        "year": "2023",
        "location": "Jakarta",
        "demo": "https://pusaka.kemenag.go.id/",
        "tags": ["Next", "TypeScript", "Laravel", "PHP", "React Native", "Django"],
        "description": "Developed a cross-platform mobile application (React Native) integrated with backend services (Django, Laravel, Next.js) for the Indonesian Ministry of Religious Affairs (KEMENAG), enhancing user engagement and streamlining access to religious services and information. The application significantly improved service delivery and user satisfaction.",
        "image": "/assets/featured-projects/pusaka.webp",
        "jpg": "/assets/featured-projects/pusaka.jpeg"
    },
    {
        "id": "featured-project-wms",
        "title": "Waste Management System",
        "year": "2025",
        "location": "Jakarta",
        "tags": ["Next", "TypeScript", "React Native"],
        "description": "Developed a comprehensive waste management system for KEMENKES using Next.js, Node.js, and React Native, resulting in a streamlined web and mobile application for efficient waste tracking and management, improving operational efficiency and data analysis capabilities.",
        "image": "/assets/featured-projects/wms.webp",
        "jpg": "/assets/featured-projects/wms.jpeg"
    }
]
