[
    {
        "id": "other-project-tte",
        "title": "Digital Signature (KEMENAG)",
        "year": "2023",
        "demo": "https://tte.kemenag.go.id/login",
        "tags": ["Laravel", "PHP"],
        "description": "Developed a secure, Laravel-based web application for Kemenag's electronic signature system, streamlining document verification and authorization processes. The application enhanced efficiency and security through robust authentication and data encryption, resulting in significant time savings and improved operational workflows.",
        "image": "/assets/other-projects/bssn.webp",
        "jpg": "/assets/other-projects/bssn.jpg"
    },
    {
        "id": "other-project-pbsb",
        "title": "PBSB (KEMENAG)",
        "year": "2023",
        "demo": "https://pendaftaran-beasiswa.kemenag.go.id/pbsb/",
        "tags": ["Laravel", "PHP", "Wordpress"],
        "description": "This project is a web application designed to manage the scholarship program for high-achieving santri (students at Islamic boarding schools) organized by the Kementerian Agama (KEMENAG), Indonesia's Ministry of Religious Affairs. The platform digitizes the entire scholarship process, making it more accessible and efficient for both applicants and administrators.",
        "image": "/assets/other-projects/kemenag.webp",
        "jpg": "/assets/other-projects/kemenag.jpg"
    },
    {
        "id": "other-project-bib",
        "title": "BIB (KEMENAG)",
        "year": "2024",
        "demo": "https://beasiswa.kemenag.go.id",
        "tags": ["Laravel", "PHP", "Wordpress"],
        "description": "This is a web application for the Beasiswa Indonesia Bangkit (BIB) scholarship program, a joint initiative by the Kementerian Agama (KEMENAG) and the Lembaga Pengelola Dana Pendidikan (LPDP). The platform is built with Laravel and serves as a digital hub for managing the entire scholarship process, from application to selection. It allows students to easily register, submit their applications and required documents online, and track the status of their submissions. The system also provides administrators with a centralized and efficient way to manage and evaluate all scholarship applications.",
        "image": "/assets/other-projects/kemenag.webp",
        "jpg": "/assets/other-projects/kemenag.jpg"
    }
]
